spec/vcr_cassettes/ExecutesStripePurchase/unsuccessful_credit_card_purchase/takes_the_response_from_the_gateway.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4000000000000002&card[exp_month]=12&card[exp_year]=2021&card[cvc]=123
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.14.0
      Authorization:
      - Bearer sk_test_9XcreVOMmIA1lYgd7EIRwfSr
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_I5k9bIO3AeHvFW","request_duration_ms":2}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.14.0","lang":"ruby","lang_version":"2.6.3 p62 (2019-04-16)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Theng-Lee.local 14.5.0 Darwin Kernel Version 14.5.0: Sun Jun  4 21:40:08 PDT
        2017; root:xnu-2782.70.3~1/RELEASE_X86_64 x86_64","hostname":"Theng-Lee.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 28 Feb 2020 07:43:10 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '787'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_DQV2XfxRHyCwFd
      Stripe-Version:
      - '2019-12-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1GH3V4HXfg0hMUpovcWOXXWM",
          "object": "token",
          "card": {
            "id": "card_1GH3V4HXfg0hMUpoz5sAQXWf",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 12,
            "exp_year": 2021,
            "fingerprint": "2vCj3LhSv8QGlo8Y",
            "funding": "credit",
            "last4": "0002",
            "metadata": {
            },
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "180.129.12.174",
          "created": 1582875790,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: null
  recorded_at: Fri, 28 Feb 2020 07:43:10 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=2500&currency=usd&source=tok_1GH3V4HXfg0hMUpovcWOXXWM&description=&metadata[reference]=reference
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.14.0
      Authorization:
      - Bearer sk_test_9XcreVOMmIA1lYgd7EIRwfSr
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_DQV2XfxRHyCwFd","request_duration_ms":1060}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.14.0","lang":"ruby","lang_version":"2.6.3 p62 (2019-04-16)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Theng-Lee.local 14.5.0 Darwin Kernel Version 14.5.0: Sun Jun  4 21:40:08 PDT
        2017; root:xnu-2782.70.3~1/RELEASE_X86_64 x86_64","hostname":"Theng-Lee.local"}'
      Idempotency-Key:
      - reference
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Fri, 28 Feb 2020 07:43:11 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '232'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - reference
      Original-Request:
      - req_I5k9bIO3AeHvFW
      Request-Id:
      - req_QWh5D6okmSwCRb
      Stripe-Version:
      - '2019-12-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: '{"error":{"message":"Keys for idempotent requests can only be used
        with the same parameters they were first used with. Try using a key other
        than ''reference'' if you meant to execute a different request.","type":"idempotency_error"}}'
    http_version: null
  recorded_at: Fri, 28 Feb 2020 07:43:11 GMT
recorded_with: VCR 5.1.0
